July2019/app/controllers/questions_controller.rb

INSERT INTO "questions" ("title", "body", "created_at", "updated_at", "view_count") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "why yellow"], ["body", "not very blue!!!"], ["created_at", "2019-09-05 20:06:50.956354"], ["updated_at", "2019-09-05 20:06:50.956354"], ["view_count", 0]]
---
  def create
    @question = Question.new question_params

    if @question.save

DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 1]]
---
  def destroy
    flash[:notice] = "Question destroyed!"
    @question.destroy

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_question
    #this will get the current value inside of the db
    @question = Question.find params[:id]